from typing import List, Tuple, Dict, Set, Optional, Union

SAMPLE_INDICATORS = {"手动输入" : None,
                   "样例一" : ["睡眠时长", "深睡比例", "清醒次数", "睡眠心率","REM", "睡眠血氧", "睡眠呼吸率", "睡眠得分", "静息心率", "血氧", "DBP", "SBP", "压力值", "步数", "活动热量", "运动心率", "心电图", "心血管风险", "脉搏波传导速度", "血管弹性", "肺功能评估", "肺部感染风险", "慢阻肺风险"],
                   "样例二" : ["睡眠时长", "深睡比例", "清醒次数", "睡眠心率","REM", "睡眠血氧", "睡眠呼吸率", "睡眠得分", "静息心率", "血氧", "DBP", "SBP", "压力值", "步数", "活动热量", "运动心率", "心电图", "心血管风险", "脉搏波传导速度", "血管弹性", "肺功能评估", "肺部感染风险", "慢阻肺风险"]
                   }

SAMPLE_DATA = {
    "手动输入" : {
        "年龄" : 18,
        "体重" : 70,
        "体脂率" : 15,
        
        "睡眠时长" : 8,
        "深睡比例" : 15,
        "清醒次数" : 0,
        "睡眠心率" : 60,
        "REM" : 1,
        "睡眠血氧" : 96,
        "睡眠呼吸率" : 15,
        "睡眠得分" : 85,
        
        "静息心率" : 70,
        "血氧" : 96,
        "DBP" : 80,
        "SBP" : 120,
        "压力值" : 20,
        
        "步数" : 5000,
        "活动热量" : 500,
        "运动心率" : 150,
        
        "心电图" : "正常", # 正常，窦性心率，失常
        "心血管风险" : "低", # 低，中，高
        "脉搏波传导速度" : "中", # 慢，中，快
        "血管弹性" : "正常", # 正常，稍差
        "肺功能评估" : "良好", # 良好，中等，较差
        "肺部感染风险" : "低", # 低，中，高
        "慢阻肺风险" : "低", # 低，中，高  
    },
    "样例一" : {
        "年龄" : 28,
        "体重" : 85,
        "体脂率" : 28,
        
        "睡眠时长" : 8,
        "深睡比例" : 15,
        "清醒次数" : 0,
        "睡眠心率" : 60,
        "REM" : 1,
        "睡眠血氧" : 96,
        "睡眠呼吸率" : 15,
        "睡眠得分" : 75,
        
        "静息心率" : 70,
        "血氧" : 96,
        "DBP" : 80,
        "SBP" : 120,
        "压力值" : 87,
        
        "步数" : 6000,
        "活动热量" : 600,
        "运动心率" : 150,
        
        "心电图" : "失常", # 正常，窦性心率，失常
        "心血管风险" : "中", # 低，中，高
        "脉搏波传导速度" : "中", # 慢，中，快
        "血管弹性" : "稍差", # 正常，稍差
        "肺功能评估" : "良好", # 良好，中等，较差
        "肺部感染风险" : "低", # 低，中，高
        "慢阻肺风险" : "低", # 低，中，高 
    },
    "样例二" : {
        "年龄" : 67,
        "体重" : 86,
        "体脂率" : 28,
        
        "睡眠时长" : 8,
        "深睡比例" : 15,
        "清醒次数" : 0,
        "睡眠心率" : 60,
        "REM" : 1,
        "睡眠血氧" : 94,
        "睡眠呼吸率" : 5,
        "睡眠得分" : 40,
        
        "静息心率" : 65,
        "血氧" : 94,
        "DBP" : 80,
        "SBP" : 120,
        "压力值" : 35,
        
        "步数" : 6000,
        "活动热量" : 300,
        "运动心率" : 150,
        
        "心电图" : "窦性心率", # 正常，窦性心率，失常
        "心血管风险" : "低", # 低，中，高
        "脉搏波传导速度" : "中", # 慢，中，快
        "血管弹性" : "稍差", # 正常，稍差
        "肺功能评估" : "中等", # 良好，中等，较差
        "肺部感染风险" : "中", # 低，中，高
        "慢阻肺风险" : "低", # 低，中，高
    }
}

SAMPLE_PROBLEMS = {
    "手动输入" : {
        "user_problem" : "",
        "user_problem_type" : {'心脏健康异常': '0', '运动表现异常': '0', '睡眠异常': '0', '肺健康异常': '0', '其他问题异常': '0'}
    },
    "样例一" : {
        "user_problem" : "我最近常常感到心慌、心悸，是怎么回事，我该如何调整?",
        "user_problem_type" : {'心脏健康异常': '1', '运动表现异常': '0', '睡眠异常': '0', '肺健康异常': '0', '其他问题异常': '0'}
    },
    "样例二" : {
        "user_problem" : "我最近常常感到呼吸不畅，是怎么回事，我该如何调整?",
        "user_problem_type" : {'心脏健康异常': '0', '运动表现异常': '0', '睡眠异常': '0', '肺健康异常': '1', '其他问题异常': '0'}
    }
}
# 名称 单位 最小值 最大值 步长 判断范围
VALUE_INDICATORS = [
    ["睡眠时长", "深睡比例", "清醒次数", "睡眠心率","REM", "睡眠血氧", "睡眠呼吸率", "睡眠得分", "静息心率", "血氧", "DBP", "SBP", "压力值", "步数", "活动热量", "运动心率"],
    ["hr", "%", "次", "次/分","hr", "%饱和度", "%", "分", "次/分", "%饱和度", "mmhg", "mmhg", "分", "步", "kcal", "次/分"],
    [0, 0, 0, 40, 0, 80, 5, 0, 40, 80, 40, 70, 0, 0, 0, 80],
    [24, 50, 10, 120, 8, 100, 40, 100, 120, 100, 120, 200, 100, 100000, 10000, 220],
    [1, 1, 1, 5, 1, 1, 1, 5, 5, 1, 5, 5, 5, 100, 100, 5],
    [(7, 9), (15, 25), (0, 2), (60, 100), (1, 2), (95, 100), (12, 20), (), (60, 79), (96, 100), (60, 80), (90, 120), (), (6000, float('inf')), (300, 700), (100, 160)]
]

# 名称 映射字典
TYPE_INDICATORS = [
    ["心电图", "心血管风险", "脉搏波传导速度", "血管弹性", "肺功能评估", "肺部感染风险", "慢阻肺风险"],
    [{"正常" : '0', "窦性心率" : '1', "失常" : '2'},
     {"低" : '0', "中" : '1', "高" : '2'},
     {"慢" : '0', "中" : '1', "快" : '2'},
     {"正常" : '0', "稍差" : '1'},
     {"良好" : '0', "中等" : '1', "较差" : '2'},
     {"低" : '0', "中" : '1', "高" : '2'},
     {"低" : '0', "中" : '1', "高" : '2'}]
]

# 转换数据
    
def check_normal(value, low, high):
    return '0' if low <= value <= high else '1'
"""
def classify_sleep(sleep):
    if sleep >= 80:
        return '0'
    elif sleep >= 60:
        return '1'
    elif sleep >= 40:
        return '2'
    elif sleep >= 20:
        return '3'
    return '4'
"""

def classify_sleep(sleep):
    if sleep >= 80:
        return '0'
    elif sleep >= 60:
        return '1'
    return '2'

def classify_pressure(pressure):
    if pressure >= 80:
        return '3'
    elif pressure >= 60:
        return '2'
    elif pressure >= 30:
        return '1'
    return '0'

def classify_age(age):
    if age < 40:
        return '0'
    elif 40 <= age < 60:
        return '1'
    else:
        return '2'

# 判断节点状态是否属于异常
def is_abnormal(indicator_name:str, indicator_type:str) -> bool:
    if indicator_name in {"体重", "体脂率", "睡眠时长", "深睡比例", "清醒次数",
                           "睡眠心率", "睡眠血氧", "睡眠呼吸率", "静息心率", "血氧",
                            "DBP", "SBP", "步数", "REM", "活动热量",
                            "运动心率", "血管弹性", "心血管风险", "肺功能评估", "肺部感染风险",
                            "慢阻肺风险"}:
        return indicator_type != "0"
    elif indicator_name in {"睡眠得分", "压力值", "心电图"}:
        return indicator_type not in {"0", "1"}
    elif indicator_name in {"脉搏波传导速度"}:
        return indicator_type != "1"
    elif indicator_name in {"年龄"}:
        return False
    
    return True

def is_improve(indicator_name:str, indicator_type:str) -> bool:
    improve_indicators = {"体重", "体脂率", "睡眠时长", "深睡比例", "压力值",
                          "静息心率", "睡眠呼吸率", "活动热量", "步数", "清醒次数",
                          "运动心率", "血氧"}
    return (indicator_name in improve_indicators) and is_abnormal(indicator_name, indicator_type)

def is_user_problem(indicator_name:str) -> bool:
    return indicator_name in {"睡眠异常", "运动表现异常", "肺健康异常", "心脏健康异常", "其他问题异常"}


if __name__ == "__main__":
    print(is_abnormal("年龄", "2"))
    print(is_abnormal("体重", "0"))
    print(is_abnormal("睡眠得分", "2"))
    print(is_improve("体脂率", "0"))